---
kind: property
id: P:Autodesk.Revit.DB.BarTypeDiameterOptions.StirrupTieBendDiameter
source: html/83fa4b05-eb78-3db7-3305-8fe8bf56f2a8.htm
---
# Autodesk.Revit.DB.BarTypeDiameterOptions.StirrupTieBendDiameter Property

Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.

## Syntax (C#)
```csharp
public double StirrupTieBendDiameter { get; set; }
```